codigo/controllers/SiteController.php

                    if ($usuario->accesos_fallidos >= Yii::$app->params['loginAttemptLimit']) {
                        $usuario->bloquearUsuario();
                        $usuario->motivo_bloqueo = 'Intentos máximos de logueo sobrepasados';
                        $usuario->save();
---
UPDATE `usuarios` SET `motivo_bloqueo`='Intentos máximos de loggeo sobrepasados' WHERE `id`=8