codigo/models/Usuario.php

public function aumentarIntentosFallidos()
{
    $this->accesos_fallidos++;

    // Verifica si es el primer fallo
    if ($this->accesos_fallidos === 1) {
        // Si es el primer fallo, guardar la fecha del primer intento fallido
        $this->primer_fallo = date('Y-m-d H:i:s');
        Yii::info('Primer fallo registrado: ' . $this->primer_fallo, 'login_attempts'); // Log para verificar
    } else {
        Yii::info('No es el primer fallo, intentos fallidos: ' . $this->accesos_fallidos, 'login_attempts');
    }

    // Intentamos guardar los cambios
    if ($this->save()) {
---
UPDATE `usuarios` SET `accesos_fallidos`=0 WHERE `id`=6

    public function reiniciarIntentosFallidos()
    {
        $this->accesos_fallidos = 0;
        $this->primer_fallo = null;
        $this->bloqueado_hasta = null; // Se reinicia la fecha de bloqueo también
        $this->save();
---
UPDATE `usuarios` SET `bloqueado`=1, `bloqueado_hasta`='2024-12-29 18:26:20' WHERE `id`=8